# RA2011026010**367**
# Fadhil Kolakkadan
# Lab 4
# CSE S1 - BATCH 2

In [1]:
import sqlite3
con = sqlite3.connect('test.db')

In [2]:
def printdb(table, col='*'):
    csr = con.execute(f"select {col} from {table}")
    for row in csr:
        print(row)

## Graded Questions

### Q1 Create the below table and execute the insert, update and the below select statements.

In [3]:
con.execute('''CREATE TABLE recipes(
id INT(11) PRIMARY KEY ,
name VARCHAR(400),
description TEXT,
category_id INT(11),
chef_id INT(255),
created DATETIME);''')

#### i) Write a query to display the total number of recipes available with the description "Chinese"

In [ ]:
res = con.execute('select * from recipes where description like "Chinese"')

#### ii) Write a query to display the id, name of the recipes with chef_id 'BL000002'.

In [5]:
con.execute(
    ''' INSERT INTO recipes (id, name, description, category_id, chef_id, created)
        VALUES (2,'Dish2','Polish',2,2,'2020-01-01')
    '''
)

In [6]:

con.execute(
    ''' INSERT INTO recipes (id, name, description, category_id, chef_id, created)
        VALUES (3,'Dish3','Polish',2,'BL000002','2020-01-01')
    '''
)

#### iii) Write a query to display the description of the recipes whose name begins with 'P'.

In [7]:
ans = con.execute('''select * from recipes''')
for row in ans:
    if row[2][0] == 'P':
        print(row)

(2, 'Dish2', 'Polish', 2, 2, '2020-01-01')
(3, 'Dish3', 'Polish', 2, 'BL000002', '2020-01-01')

In [8]:
con.commit()

### Q2. Create a table movie of the below structure and assume data types.Movie_ID,Movie_Name, Genre, Language, Rating ,Do the following queries

In [13]:
con.execute(
    '''
    CREATE TABLE movie(
        Movie_ID INT PRIMARY KEY,
        Movie_Name VARCHAR(100),
        Genre VARCHAR(50),
        Language VARCHAR(20),
        Rating FLOAT(3)
    );
    '''
)

In [14]:
for n in range(11):
    con.execute(
        f'''
        INSERT INTO movie(Movie_ID,Movie_Name,Genre,Language,Rating) 
        VALUES ({98+n},'Movie{n}','Programming','English',{n+(n/10)});
        '''
    )

#### a. Update the movies rating by 10% and display it

In [16]:
con.execute(f'UPDATE movie SET Rating = Rating+(Rating/10);')

In [17]:
res = con.execute('SELECT ROUND(Rating,2) FROM movie;')
for row in res:
    print(row)

(0.0,)
(1.33,)
(2.66,)
(3.99,)
(5.32,)
(6.66,)
(7.99,)
(9.32,)
(10.65,)
(11.98,)
(13.31,)

#### b. Delete the movies with movie_id 102

In [18]:
con.execute('DELETE FROM movie WHERE Movie_ID =102;')

In [19]:
printdb('movie')

(98, 'Movie0', 'Programming', 'English', 0.0)
(99, 'Movie1', 'Programming', 'English', 1.3310000000000002)
(100, 'Movie2', 'Programming', 'English', 2.6620000000000004)
(101, 'Movie3', 'Programming', 'English', 3.993)
(103, 'Movie5', 'Programming', 'English', 6.654999999999999)
(104, 'Movie6', 'Programming', 'English', 7.986)
(105, 'Movie7', 'Programming', 'English', 9.317)
(106, 'Movie8', 'Programming', 'English', 10.648000000000001)
(107, 'Movie9', 'Programming', 'English', 11.979000000000001)
(108, 'Movie10', 'Programming', 'English', 13.309999999999999)

#### c. Select movies whose rating is more than 3.

In [20]:
ans = con.execute(
    'SELECT Movie_Name,ROUND(Rating,2) as Rating FROM movie WHERE Rating > 3;')
for row in ans:
    print(row)

('Movie3', 3.99)
('Movie5', 6.66)
('Movie6', 7.99)
('Movie7', 9.32)
('Movie8', 10.65)
('Movie9', 11.98)
('Movie10', 13.31)

### Q3. Create a course database with the following fields

- Product(_ID_ , Prod_name ,Supplier_id ,_Unit_price_ ,Package ,OrderID),
- OrderItem(_ID_ ,Order_id ,Product_id ,_Unit_price_ ,Quantity) using Foreign key

In [21]:
con.execute('''
CREATE TABLE product(
    product_ID INT PRIMARY KEY,
    Product_Name VARCHAR(100),
    Supplier_ID INT,
    Unit_Price FLOAT,
    Package VARCHAR(50),
    Order_ID INT
    );
    ''')
con.execute('''
CREATE TABLE orderitem(
    Order_ID INT PRIMARY KEY,
    Product_ID INT,
    Unit_Price FLOAT,
    Quantity INT,
    CONSTRAINT fk_product
    FOREIGN KEY (product_ID)
    REFERENCES product(product_ID)
    );''')

In [22]:
con.execute("DELETE FROM product;")

In [23]:
for i in range(1,11):
    con.execute(
        f'''
        INSERT INTO product(product_ID,Product_Name,Supplier_ID,Unit_Price,Package,Order_ID)
        VALUES ({i},'Product{i}',{i},{i**3+(i/10)},{i*i + 2},{1000+i*3});
        '''
    )

In [24]:
for i in range(1,11):
    con.execute(
        f'''
        INSERT INTO orderitem(Order_ID,Product_ID,Unit_Price,Quantity)
        VALUES ({1000+i*3},{i},{i**3+(i/10)},{i*i});
        '''
    )

In [25]:
printdb('product')
print('-'*50)
printdb('orderitem')

(1, 'Product1', 1, 1.1, '3', 1003)
(2, 'Product2', 2, 8.2, '6', 1006)
(3, 'Product3', 3, 27.3, '11', 1009)
(4, 'Product4', 4, 64.4, '18', 1012)
(5, 'Product5', 5, 125.5, '27', 1015)
(6, 'Product6', 6, 216.6, '38', 1018)
(7, 'Product7', 7, 343.7, '51', 1021)
(8, 'Product8', 8, 512.8, '66', 1024)
(9, 'Product9', 9, 729.9, '83', 1027)
(10, 'Product10', 10, 1001.0, '102', 1030)
--------------------------------------------------
(1003, 1, 1.1, 1)
(1006, 2, 8.2, 4)
(1009, 3, 27.3, 9)
(1012, 4, 64.4, 16)
(1015, 5, 125.5, 25)
(1018, 6, 216.6, 36)
(1021, 7, 343.7, 49)
(1024, 8, 512.8, 64)
(1027, 9, 729.9, 81)
(1030, 10, 1001.0, 100)

#### d. Display the total quantity of every product in the stock

In [26]:
ans = con.execute('''
SELECT product.Product_Name,orderitem.Quantity
FROM product INNER JOIN orderitem ON product.product_ID = orderitem.product_ID
''')
for row in ans:
    print(row)

('Product1', 1)
('Product2', 4)
('Product3', 9)
('Product4', 16)
('Product5', 25)
('Product6', 36)
('Product7', 49)
('Product8', 64)
('Product9', 81)
('Product10', 100)

#### e. Sort the Unit_price based on the supplier_id

In [27]:
res = con.execute("SELECT Unit_Price,Product_Name FROM product ORDER BY Supplier_ID;")
for row in res:
    print(row)

(1.1, 'Product1')
(8.2, 'Product2')
(27.3, 'Product3')
(64.4, 'Product4')
(125.5, 'Product5')
(216.6, 'Product6')
(343.7, 'Product7')
(512.8, 'Product8')
(729.9, 'Product9')
(1001.0, 'Product10')

#### f. Display the Product_name along with order_id an

In [28]:
res = con.execute("SELECT Product_Name,Order_ID,Supplier_ID FROM product;")
for row in res:
    print(row)

('Product1', 1003, 1)
('Product2', 1006, 2)
('Product3', 1009, 3)
('Product4', 1012, 4)
('Product5', 1015, 5)
('Product6', 1018, 6)
('Product7', 1021, 7)
('Product8', 1024, 8)
('Product9', 1027, 9)
('Product10', 1030, 10)

### Q4. Write a SQL lite3 statement to create a table named as job including columns job_id,job_title,Min-salary,Max_salary.job_id column does not contain any duplicate value at the time of insertion

In [29]:
con.execute('''
CREATE TABLE job(
    job_id INT PRIMARY KEY,
    job_title VARCHAR(100),
    Min_salary FLOAT,
    Max_salary FLOAT
);
''')

con.execute('''
INSERT INTO job(job_id,job_title,Min_salary,Max_salary)
VALUES (1,'Developer',1000,2000);
''')

**Using the primary key property on job_id makes sure there are no duplicate values**

### 5. Write a SQL lite3 statement to create a table names as job_history including columns employee_id, start_date, end_date, job_id and department_id and make sure that, the employee_id column does not contain any duplicate value at the time of insertion and the foreign key column job_id contain only those values which are exist in the job table.

In [30]:
con.execute(
    '''
    CREATE TABLE job_history(
        employee_id INT PRIMARY KEY,
        start_date DATE,
        end_date DATE,
        job_id INT,
        department_id INT,
        CONSTRAINT fk_job
        FOREIGN KEY (job_id)
        REFERENCES jobs(job_id)
    );
    '''
)

In [31]:
res = con.execute("SELECT name FROM sqlite_master WHERE type='table';")
for row in res:
    print(row)

('recipes',)
('movie',)
('product',)
('orderitem',)
('job',)
('job_history',)

def solution: